Revit 2027 API
StructuralAsset.MetalThermallyTreated Property
 Flag indicating whether the asset describes a material that is thermally treated or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool MetalThermallyTreated { get; set; }
Public Property MetalThermallyTreated As Boolean
	Get
	Set
public:
property bool MetalThermallyTreated {
	bool get ();
	void set (bool value);
}
member MetalThermallyTreated : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InapplicableDataException |  When setting this property: the material type must be Metal to set this property.
Remarks
 Applies to Metal-based structural assets.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace